test.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-04-05 四 16:58 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>git工作流程</title>
<meta name="generator" content="Org mode" />
</head>
<body>
<div id="content">
<h1 class="title">git工作流程</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orga7f8c83">1. <span class="todo TODO">TODO</span> GIT学习进度流程</a>
<ul>
<li><a href="#org0887b6c">1.1. <span class="done DONE">DONE</span> 初步建立Git版本控制系统 <code>[1/1]</code></a>
<ul>
<li><a href="#org0fc6d28">1.1.1. <span class="done DONE">DONE</span> 前期建立工作</a></li>
</ul>
</li>
<li><a href="#org270c52e">1.2. <span class="done DONE">DONE</span> 于服务器搭建git环境，同步进行文件管理</a>
<ul>
<li><a href="#org8e195a4">1.2.1. 启动业余任务，构建远程写作环境</a></li>
</ul>
</li>
<li><a href="#org2a700ef">1.3. <span class="todo TODO">TODO</span> 学习分支操作，进行分支管理</a></li>
</ul>
</li>
<li><a href="#org81ce8c3">2. Note</a>
<ul>
<li>
<ul>
<li><a href="#org3913301">2.0.1. 添加一个文件到git目录</a></li>
<li><a href="#orga8f1e26">2.0.2. 检查文件状态并提交修改</a></li>
<li><a href="#orga1e9347">2.0.3. 版本回退和修改查询</a></li>
<li><a href="#org6521396">2.0.4. Git控制理念</a></li>
<li><a href="#org4df78a2">2.0.5. 远程仓库</a></li>
<li><a href="#orgf6fb8eb">2.0.6. 使用密钥文件进行远程连接</a></li>
<li><a href="#org36be863">2.0.7. 可以配置变量别名以更好的使用git</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgf891b6d">3. Test<sub>reset</sub></a></li>
</ul>
</div>
</div>
<div id="outline-container-orga7f8c83" class="outline-2">
<h2 id="orga7f8c83"><span class="section-number-2">1</span> <span class="todo TODO">TODO</span> GIT学习进度流程</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org0887b6c" class="outline-3">
<h3 id="org0887b6c"><span class="section-number-3">1.1</span> <span class="done DONE">DONE</span> 初步建立Git版本控制系统 <code>[1/1]</code></h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>State "DONE"       from "TODO"       <span class="timestamp-wrapper"><span class="timestamp">[2018-04-03 二 17:04]</span></span></li>
</ul>
</div>
<div id="outline-container-org0fc6d28" class="outline-4">
<h4 id="org0fc6d28"><span class="section-number-4">1.1.1</span> <span class="done DONE">DONE</span> 前期建立工作</h4>
<div class="outline-text-4" id="text-1-1-1">
<ul class="org-ul">
<li>State "DONE"       from "TODO"       <span class="timestamp-wrapper"><span class="timestamp">[2018-04-03 二 17:04]</span></span></li>
</ul>
</div>
<ol class="org-ol">
<li><a id="org6e2ea75"></a>git基础<br />
<div class="outline-text-5" id="text-1-1-1-1">
<p>
使用github进行前期测试，并完成git基本命令的学习；
</p>
</div>
</li>
<li><a id="org6c73035"></a>于github上建立test文件夹，学习远程版本控制和分支管理<br /></li>
</ol>
</div>
</div>
<div id="outline-container-org270c52e" class="outline-3">
<h3 id="org270c52e"><span class="section-number-3">1.2</span> <span class="done DONE">DONE</span> 于服务器搭建git环境，同步进行文件管理</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li>State "DONE"       from "TODO"       <span class="timestamp-wrapper"><span class="timestamp">[2018-04-03 二 17:04]</span></span></li>
</ul>
</div>
<div id="outline-container-org8e195a4" class="outline-4">
<h4 id="org8e195a4"><span class="section-number-4">1.2.1</span> 启动业余任务，构建远程写作环境</h4>
</div>
</div>
<div id="outline-container-org2a700ef" class="outline-3">
<h3 id="org2a700ef"><span class="section-number-3">1.3</span> <span class="todo TODO">TODO</span> 学习分支操作，进行分支管理</h3>
<div class="outline-text-3" id="text-1-3">
</div>
</div>
</div>
<div id="outline-container-org81ce8c3" class="outline-2">
<h2 id="org81ce8c3"><span class="section-number-2">2</span> Note</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org3913301" class="outline-4">
<h4 id="org3913301"><span class="section-number-4">2.0.1</span> 添加一个文件到git目录</h4>
<div class="outline-text-4" id="text-2-0-1">
<pre class="example">
git init：初始化一个仓库，在需要使用git进行版本控制的时候使用
git add "FileName"
git commit -m 
  -m：添加提交说明；
  commit一次性可以提交多个文件，可以在add时添加多个不同的文件
</pre>
</div>
</div>
<div id="outline-container-orga8f1e26" class="outline-4">
<h4 id="orga8f1e26"><span class="section-number-4">2.0.2</span> 检查文件状态并提交修改</h4>
<div class="outline-text-4" id="text-2-0-2">
<pre class="example">
git status：查看当前仓库文件的状态
git diff：查看文件上次提交后有拿些修改
然后可以执行git add 和 git commit 提交修改
</pre>
</div>
</div>
<div id="outline-container-orga1e9347" class="outline-4">
<h4 id="orga1e9347"><span class="section-number-4">2.0.3</span> 版本回退和修改查询</h4>
<div class="outline-text-4" id="text-2-0-3">
<pre class="example">
git log
  显示所有提交日志

git reset --hard HEAD^
  回退到上一个版本：
git reset --hard COMMIT_ID
  回退到指定的版本：
get reflog
  查看所有版本的操作记录

git checkout：是用版本库里的版本替换工作区的版本 
</pre>
<p>
首先，Git必须知道当前版本是哪个版本，在Git中，用HEAD表示当前版本，也就是最新的提交，上一个版本就是HEAD^，上上一个版本就是HEAD^^，当然往上100个版本写100个<sup>比较容易数不过来</sup>，所以写成HEAD~100。
</p>
</div>
</div>
<div id="outline-container-org6521396" class="outline-4">
<h4 id="org6521396"><span class="section-number-4">2.0.4</span> Git控制理念</h4>
<div class="outline-text-4" id="text-2-0-4">
<p>
git使用add选项首先将文件的修改内容存放至暂存区(index/stage)
</p>

<p>
然后再使用commit时将暂存区的所有内容提交至当前分支；
</p>
</div>
</div>
<div id="outline-container-org4df78a2" class="outline-4">
<h4 id="org4df78a2"><span class="section-number-4">2.0.5</span> 远程仓库</h4>
<div class="outline-text-4" id="text-2-0-5">
<pre class="example">
$ git remote add origin git@github.com:LOVEXUE/Test-git.git
$ git push -u origin master
  将本地仓库内容推送至github中（先进入本地仓库）

  建立远程仓库后，要将文件夹的权限进行调整

git remote add origin git@server-name:path/repo-name.git
  关联远程仓库
git push -u origin master
  推送本地内容至远程仓库中
git clone git@server-name:path/repo-name.git /path/to/localfile
  从远程仓库复制文件到本地
</pre>
</div>
</div>
<div id="outline-container-orgf6fb8eb" class="outline-4">
<h4 id="orgf6fb8eb"><span class="section-number-4">2.0.6</span> 使用密钥文件进行远程连接</h4>
<div class="outline-text-4" id="text-2-0-6">
<p>
在要与远程服务器的连接上创建密钥对，然后将公钥文件内容复制至服务器相应帐号下: ~/.ssh/authorized<sub>key</sub>
</p>
<pre class="example">
# 如果authorized_keys不存在，则创建它
  touch ~/.ssh/authorized_keys
# 将上传的公钥添加到authorized_keys后面
  cat ~/.ssh/id_rsa.pub_192.168.1.104 &gt;&gt; ~/.ssh/authorized_keys
# 修改authorized_keys权限
  chmod 700 ~/.ssh
  chmod 600 ~/.ssh/authorized_keys
# 查看authorized_keys最后一行
  tail -1 ~/.ssh/authorized_keys   
</pre>
</div>
</div>
<div id="outline-container-org36be863" class="outline-4">
<h4 id="org36be863"><span class="section-number-4">2.0.7</span> 可以配置变量别名以更好的使用git</h4>
<div class="outline-text-4" id="text-2-0-7">
<p>
git config &#x2013;global alias.aliasname  command<sub>name</sub>
</p>
</div>
</div>
</div>
<div id="outline-container-orgf891b6d" class="outline-2">
<h2 id="orgf891b6d"><span class="section-number-2">3</span> Test<sub>reset</sub></h2>
<div class="outline-text-2" id="text-3">
<p>
git@118.24.23.137:/home/git/fiction.git
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2018-04-05 四 16:58</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>